# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [67]:
# magic, dependencies, load data
%matplotlib inline

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import scipy.stats as sts

city = "resources/city_data.csv"
ride = "resources/ride_data.csv"
city_df = pd.read_csv(city)
ride_df = pd.read_csv(ride)

### Merge the DataFrames

In [68]:
# merge and create DFs per city type
pyber_df = pd.merge(ride_df, city_df, how = "left", on =["city", "city"])

## Deliverable 1: Get a Summary DataFrame

In [69]:
# 1. Get the total rides for each city type
total_rides = pyber_df.groupby(["type"]).count()[["ride_id"]]

In [70]:
# 2. get the total drivers for each city type
driver_per_city = pyber_df[["type", "city", "driver_count"]]
driver_per_city = driver_per_city.drop_duplicates()

total_drivers = driver_per_city.groupby(["type"]).sum()[["driver_count"]]

In [71]:
#  3. Get the total amount of fares for each city type
total_fares = pyber_df.groupby(["type"]).sum()[["fare"]]

In [72]:
#  4. Get the average fare per ride for each city type.
fare_per_ride = round(pyber_df.groupby(["type"]).sum()["fare"] / pyber_df.groupby(["type"]).count()["ride_id"], 2)

In [73]:
# 5. Get the average fare per driver for each city type. 
fare_per_driver = round(pyber_df.groupby(["type"]).sum()["fare"] / driver_per_city.groupby(["type"]).sum()["driver_count"], 2)

In [74]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pd.concat([total_rides, total_drivers, total_fares, fare_per_ride, fare_per_driver], axis=1)
pyber_summary_df.columns = ["Total_Rides", "Total_Drivers", "Total_Fares", "Mean_Fare_Ride", "Mean_Fare_Driver"]

In [66]:
#  7 and 8. Cleaning up the DataFrame. Delete the index name + format as necessary
pyber_summary_df.index.name = None
pyber_summary_df["Total_Fares"] = pyber_summary_df["Total_Fares"].map("${:,.2f}".format)
pyber_summary_df["Mean_Fare_Ride"] = pyber_summary_df["Mean_Fare_Ride"].map("${:,.2f}".format)
pyber_summary_df["Mean_Fare_Driver"] = pyber_summary_df["Mean_Fare_Driver"].map("${:,.2f}".format)
pyber_summary_df

,Total_Rides,Total_Drivers,Total_Fares,Mean_Fare_Ride,Mean_Fare_Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,1625,2405,"$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [495]:
# 1. Read the merged DataFrame
pyber_weekly_df = pyber_df
pyber_weekly_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [496]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
fare_per_city_date = pyber_weekly_df.groupby(["type", "date"]).sum()[["fare"]]
fare_per_city_date

                            fare
type  date
Rural 2019-01-01 09:45:36  43.69
      2019-01-02 11:18:32  52.12
      2019-01-03 19:51:01  19.90
      2019-01-04 03:31:26  24.88
      2019-01-06 07:38:40  47.33
...                          ...
Urban 2019-05-08 04:20:00  21.99
      2019-05-08 04:39:49  18.45
      2019-05-08 07:29:01  18.55
      2019-05-08 11:38:35  19.77
      2019-05-08 13:10:18  18.04

[2375 rows x 1 columns]

In [498]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
pyber_weekly_df = pyber_weekly_df.reset_index()
pyber_weekly_df

,level_0,index,city,date,fare,ride_id,driver_count,type
0,0,0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,1,1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,2,2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,3,3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,4,4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...,...,...
2370,2370,2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,2371,2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,2372,2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,2373,2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,2374,2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [499]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
pyber_weekly_df.pivot(index = "date", columns = "type" , values = "fare")

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-05-08 04:20:00    NaN       NaN  21.99
2019-05-08 04:39:49    NaN       NaN  18.45
2019-05-08 07:29:01    NaN       NaN  18.55
2019-05-08 11:38:35    NaN       NaN  19.77
2019-05-08 13:10:18    NaN       NaN  18.04

[2375 rows x 3 columns]

In [500]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [346]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)
pyber_weekly_df.index = pd.to_datetime(pyber_weekly_df.index)

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')